/*
Вывести на экран текст "лесенкой"
	 Let's
           go
               to walk
*/

#include <stdio.h>

int main() {
	printf("Let's\n"); // \n перенос строки
	printf("      go\n");
	printf("          to walk\n");
	return 0;
}
